
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "Impossível carregar o URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "Impossível estabelecer ligação ao host %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "Cabeçalho inválido recebido do servidor";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "Impossível determinar o endereço IP do host: %@";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "Impossível obter a descrição da porta %d";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "Impossível estabelecer ligação ao host %@ via porta %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "Recebida resposta de servidor HTTP desconhecida %@: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "Pedido HTTP falhou para o URL %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "A ligação ao host %@ foi perdida";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "Impossível ler de %@";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "Loop detectado ao tentar carregar o URL %@";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "Serviço indisponível para o host %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "Impossível abrir a ligação de dados do percurso do URL: %@";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "Objecto indisponível para o URL: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "Comando FTP não reconhecido pelo host: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "Acesso do utilizador ou palavra-passe não reconhecidos.";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f GB";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f KB";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f MB";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f bytes";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f GB";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f GB";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f KB";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f KB";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f KB";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f MB";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f MB";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ de %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 bytes";

/* String used for showing a one byte size */
"1 byte" = "1 byte";

/* WebFoundationErrorCannotCreateFile description */
"Cannot create file" = "Impossível criar ficheiro";

/* WebFoundationErrorCannotMoveFile description */
"Cannot move file" = "Impossível mover ficheiro";

/* WebFoundationErrorCannotOpenFile description */
"Cannot open file" = "Impossível abrir ficheiro";

/* WebFoundationErrorCannotRemoveFile description */
"Cannot remove file" = "Impossível remover ficheiro";

/* WebFoundationErrorCannotWriteToFile description */
"Cannot write file" = "Impossível escrever ficheiro";

/* WebFoundationErrorDNSLookupError description */
"DNS lookup error" = "Erro de pesquisa de DNS";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Download decoding failed (at end)" = "A descodificação da descarga falhou";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Download decoding failed (midstream)" = "A descodificação da descarga falhou";

/* WebFoundationErrorCannotCloseFile description */
"Failure occurred while closing file" = "Ocorreu uma falha ao fechar o ficheiro";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "Palavra-passe no formato Web";

/* HTTP result code string */
"accepted" = "aceite";

/* WebFoundationErrorBadURLError description */
"bad URL" = "URL inválido";

/* HTTP result code string */
"bad gateway" = "gateway inválido";

/* HTTP result code string */
"bad request" = "pedido inválido";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"bad server certificate" = "certificado de servidor inválido";

/* WebFoundationErrorBadServerResponseError description */
"bad server response" = "resposta do servidor inválido";

/* WebFoundationErrorCannotDecodeRawData description */
"cannot decode raw data" = "não é possível descodificar dados não formatados";

/* WebFoundationErrorCannotDecodeContentData description */
"cannot decode content data" = "não é possível descodificar dados de conteúdo";

/* WebFoundationErrorCannotParseResponse description */
"cannot parse response" = "não é possível analisar a resposta";

/* WebFoundationErrorCancelled description */
"cancelled" = "cancelado";

/* WebFoundationErrorCannotConnectToHostError description */
"can't connect to host" = "impossível estabelecer ligação ao host";

/* WebFoundationErrorCannotFindHostError description */
"can't find host" = "impossível localizar host";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"can't load from network" = "impossível carregar a partir da rede";

/* HTTP result code string */
"client error" = "erro no cliente";

/* HTTP result code string */
"conflict" = "conflito";

/* HTTP result code string */
"continue" = "continuar";

/* HTTP result code string */
"created" = "criação";

/* WebFoundationErrorReadStreamError description */
"error reading stream" = "erro na leitura da sequência";

/* HTTP result code string */
"expectation failed" = "a expectativa falhou";

/* WebFoundationErrorServerCertificateHasBadDate description */
"expired server certificate" = "o certificador para o servidor expirou";

/* WebFoundationErrorFileDoesNotExist description */
"file doesn't exist" = "ficheiro inexistente";

/* WebFoundationErrorFileIsDirectory description */
"file is directory" = "o ficheiro é um directório";

/* HTTP result code string */
"forbidden" = "não permitido";

/* HTTP result code string */
"found" = "existente";

/* HTTP result code string */
"gateway timed out" = "sem resposta do gateway";

/* HTTP result code string */
"informational" = "informativo";

/* HTTP result code string */
"internal server error" = "erro no servidor interno";

/* HTTP result code string */
"length required" = "é necessário um comprimento";

/* WebFoundationErrorNetworkConnectionLostError description */
"lost network connection" = "a ligação à rede foi interrompida";

/* HTTP result code string */
"method not allowed" = "método não permitido";

/* HTTP result code string */
"moved permanently" = "permanentemente deslocado";

/* HTTP result code string */
"multiple choices" = "várias opções";

/* HTTP result code string */
"needs proxy" = "é necessário um proxy";

/* WebFoundationErrorNotConnectedToInternetError description */
"no Internet connection" = "ligação Internet inexistente";

/* HTTP result code string */
"no content" = "conteúdo inexistente";

/* HTTP result code string */
"no error" = "erro inexistente";

/* HTTP result code string */
"no longer exists" = "inexistente";

/* WebFoundationErrorNoPermissionsToReadFile description */
"no permissions to read file" = "permissões para leitura de ficheiro inexistentes";

/* HTTP result code string */
"non-authoritative information" = "informação não autorizada";

/* HTTP result code string */
"not found" = "inexistente";

/* HTTP result code string */
"not modified" = "inalterado";

/* HTTP result code string */
"partial content" = "conteúdo parcial";

/* HTTP result code string */
"payment required" = "é necessário efectuar um pagamento";

/* HTTP result code string */
"precondition failed" = "a pré-condição falhou";

/* HTTP result code string */
"proxy authentication required" = "é necessária a autenticação do proxy";

/* HTTP result code string */
"redirected" = "redireccionar";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"redirected to nowhere" = "redireccionamento inválido";

/* HTTP result code string */
"request timed out" = "pedido sem resposta";

/* HTTP result code string */
"request too large" = "solicitação demasiado longa";

/* HTTP result code string */
"requested URL too long" = "URL solicitado demasiado longo";

/* HTTP result code string */
"requested range not satisfiable" = "o intervalo solicitado é inválido";

/* HTTP result code string */
"reset content" = "anular conteúdo";

/* WebFoundationErrorResourceUnavailableError description */
"resource unavailable" = "recurso indisponível";

/* WebFoundationErrorSecureConnectionFailed description */
"secure connection failed" = "a ligação segura falhou";

/* HTTP result code string */
"see other" = "ver outro";

/* HTTP result code string */
"server error" = "erro no servidor";

/* HTTP result code string */
"service unavailable" = "serviço indisponível";

/* HTTP result code string */
"success" = "sucesso";

/* HTTP result code string */
"switching protocols" = "a alterar protolocos";

/* HTTP result code string */
"temporarily redirected" = "redireccionamento temporário";

/* WebFoundationErrorTimedOut description */
"timed out" = "sem resposta";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"too many HTTP redirects" = "demasiados redireccionamentos HTTP";

/* HTTP result code string */
"unacceptable" = "inaceitável";

/* HTTP result code string */
"unauthorized" = "não autorizado";

/* HTTP result code string */
"unimplemented" = "não implementado";

/* Unknown filename */
"unknown" = "desconhecido";

/* WebFoundationErrorUnsupportedURL description */
"unsupported URL" = "URL não suportado";

/* HTTP result code string */
"unsupported media type" = "media não suportado";

/* HTTP result code string */
"unsupported version" = "versão não suportada";

/* WebFoundationErrorServerCertificateUntrusted description */
"untrusted server certificate" = "o certificado do servidor não é fiável";

/* WebFoundationErrorZeroByteResourceError description */
"zero byte resource" = "recurso com zero bytes";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"resource exceeds maximum size" = "o recurso excede o tamanho máximo";
